<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"57d5e14447ca8e26aba95929eeb2955ae2ed560660f3ed0215546ff093d5fa29","plan_job_ref":"Job .github/workflows/_test-tf.yaml #233 at https://github.com/tx-pts-dai/github-workflows/actions/runs/12488549128","plan_out_hash":"1af2b4da7426371f240e1d82ce5662afe7ad46976bac3f3a7f0111aa388b1ea8","plan_hash":"8b1aadc6bbbb91bf8c5206629087c0e03936a3b09af7e7346d53560abd2bf7ff","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #233](https://github.com/tx-pts-dai/github-workflows/actions/runs/12488549128)